{"pages":[],"posts":[{"title":"Menampilkan Error di Halaman Blank PHP","text":"Adakalanya ketika kita mengakses website atau halaman web yang kita bangun, kita hanya ditampilkan halaman BLANK putih saja, yang membuat kita bingung apa yang terjadi di web tersebut.Untuk menampilkan error di website yang menggunakan PHP, copy dan paste kode berikut di file php yang ingin kamu debug. Pastikan kamu meletakkan kode berikut di baris paling awal. 123ini_set('display_errors', 1);ini_set('display_startup_errors', 1);error_reporting(E_ALL); Kode diatas cara tercepat untuk menampilkan php error dan warning dari halaman web kita yang hanya tampil tampilan BLANK saja.Sekian tips singkat dan sederhana dari saya, semoga bermanfaat.","link":"/2020/01/29/Menampilkan-Error-di-Halaman-Blank-PHP/"},{"title":"Membuat Report PDF Laravel Dengan Package Laravel Snappy","text":"Sangat banyak sekali package Laravel untuk membuat laporan dalam bentuk PDF. Nah kali ini kita akan meggunakan package Laravel Snappy. Kenapa Laravel Snappy ? Dari yang saya coba di beberapa aplikasi yang saya buat dengan package Laravel Snappy. Package ini dapat menampilkan Grafik pada PDF dengan cepat, dan juga menampilkan halaman pdf yang berisi teks biasa, tabel, gambar dan konten lainnya secara cepat. Kenapa bisa cepat ? di Laravel Snappy prinsip kerjanya adalah mengubah tampilan (view) yang kita desain dalam kode HTML biasa menjadi file PDF dengan sangat cepat ketimbang package lainnya untuk membuat PDF di laravel. Oh ya, sebelum lanjut ke tutorialnya saya disini menginstall web laravel saya di server ubuntu 18.04. Nah, jika kamu yang menginstal web laravelnya di hosting atau shared hosting tenang saja, nanti akan saya jelaskan sedikit perbedaanya saat pemasangan package ini. Oke kita mulai.. Proses Instalasi Install dependecies yang diperlukan Note. Jika kamu menginstall di server 32 bit install depedencies berikut.Ketik di terminal 12$ composer require h4cc/wkhtmltopdf-i386 0.12.x$ composer require h4cc/wkhtmltoimage-i386 0.12.x Note. Jika kamu menginstall di server 64 bit install depedencies berikut.Ketik di terminal 12$ composer require h4cc/wkhtmltopdf-amd64 0.12.x$ composer require h4cc/wkhtmltoimage-amd64 0.12.x Install package yang diperlukan Install package berikut, ketik di terminal 1composer require barryvdh/laravel-snappy Konfigurasi package yang telah di install Buka projek laravel kamu, masuk ke folder config. Lalu buka file app.php. Pada bagian providers tambahkan class package seperti diatas. dan pada bagian aliases tambahkan class PDF dan class SnappyImage. Publish vendor folder Jalankan perintah berikut di terminal 1php artisan vendor:publish --provider=\"Barryvdh\\Snappy\\ServiceProvider\" Oke, setelah maluli tahap proses instalasi, kita akan masuk ke tahapan konfigurasi yang cukup melelahkan, hehehhe. Tahap KonfigurasiKetik di terminal 1cp vendor/h4cc/wkhtmltoimage-amd64/bin/wkhtmltoimage-amd64 /usr/local/bin/ Lalu ketik lagi 1cp vendor/h4cc/wkhtmltopdf-amd64/bin/wkhtmltopdf-amd64 /usr/local/bin/ Note : Jika kamu menginstall web laravel nya di server langsung ikuti cara ini, jika di shared hosting abaikan tahapan ini. Setelah menjalankan perintah copy diatas, selanjutnya set kedua folder di lokasi tujuan copy diatas menjadi permission 777. Ketik lagi 12chmod -R 777 /usr/local/bin/wkhtmltoimage-amd64chmod -R 777 /usr/local/bin/wkhtmltopdf-amd64 Sekarang lakukan konfigurasi pada file projek laravel kamu config/snappy.php. Untuk yang menginstall di server langsung Sesuaikan isi nya dengan isi berikut. 12345678910111213141516return array( 'pdf' =&gt; array( 'enabled' =&gt; true, 'binary' =&gt; '/usr/local/bin/wkhtmltopdf-amd64', 'timeout' =&gt; false, 'options' =&gt; array(), 'env' =&gt; array(), ), 'image' =&gt; array( 'enabled' =&gt; true, 'binary' =&gt; '/usr/local/bin/wkhtmltoimage-amd64', 'timeout' =&gt; false, 'options' =&gt; array(), 'env' =&gt; array(), ),); Untuk yang menginstall di shared hosting Sesuaikan isi nya dengan isi berikut. 12345678910111213141516return array( 'pdf' =&gt; array( 'enabled' =&gt; true, 'binary' =&gt; base_path('vendor/h4cc/wkhtmltopdf-amd64/bin/wkhtmltopdf-amd64'), 'timeout' =&gt; false, 'options' =&gt; array(), 'env' =&gt; array(), ), 'image' =&gt; array( 'enabled' =&gt; true, 'binary' =&gt; base_path('vendor/h4cc/wkhtmltoimage-amd64/bin/wkhtmltoimage-amd64'), 'timeout' =&gt; false, 'options' =&gt; array(), 'env' =&gt; array(), ),); SELESAI…. Kamu bisa mencoba untuk mengenerate file PDF di laravel Untuk penggunaan Laravel Snappy sendiri kamu bisa langsung cek dokumentasinya di https://github.com/barryvdh/laravel-snappy TroubleshootJika setelah melakukan tahapan instalasi dan kofigutasi kamu dapati error 12The exit status code '1' says something went wrong:stderr: \"blablablabalbalba\" Berikut solusi nya untuk ubuntu 18.04 1sudo apt install libssl1.0-dev untuk ubuntu 14.04 1sudo apt install libssl-dev=1.0.1f-1ubuntu2.25","link":"/2020/03/02/Membuat-Report-PDF-Laravel-Dengan-Package-Laravel-Snappy/"},{"title":"Monitoring Proses Di Linux Dengan TOP Command","text":"TOP! Kali ini saya akan berbagi pengalaman dan sedikit ilmu dalam dunia Linux. Saya sendiri bukan orang yang expert di bidang linux, tapi saya akan share bagaimana cara memonitor linux secara real time dalam hal kinerja sistem seperti CPU, Memory, Serta Proses yang sedang berjalan. Perintah yang kita gunakan untuk memonitor linux ini adalah dengan perintah TOP. Oh ya, perintah TOP ini sangat bermanfaat dan sering digunakan jika di dalam server linux kamu terdapat beberapa website. Ketika salah satu website di server tersebut DOWN, kita bisa memantau website mana yang DOWN, apakah karena murni Traffic pengunjung atau di DDOS, atau ada IP yang SPAMMING ke website kita. OK, langsung kita praktekkan perintah TOP ini. Ketik diterminal… 1top Maka akan keluar hasil Penjelasan dari keluaran perintah TOP di atas. 1. ROW - TOP (baris pertama) Disini kita bisa melihat informasi berupa :Waktu saat ini : (09:56:29)Mesin Berjalan : (up 36 hari)Sesi user login : 1 userRata-rata beban systen (load average: 2.29, 2.60, 3.45) 2. Task Disini kita bisa melihat informasi berupa :Total proces yang sedang berjalan (264 total)Proses yang sedang berjalan (1 running)Proses yang sleeping (261 sleeping)Proses yang sedang berhenti (0 stoped)Proses zombie (2 zombie) 3. CPU Disini kita bisa melihat informasi berupa :Persentase pemakaian CPU untuk proses pengguna (18.1% us)Persentase proses CPU yang digunakan sistem (5.3%sy)Persentase proses CPU yang mendapatkan prioritas Update (0.0% ni)Presentase CPU yang tidak terpakai (73.9% id)Persentase CPU yang menunggu proses I/O (1.9% wa)Penggunaan CPU untuk service hardware (0.0% hi)Penggunaan CPU untuk service software (0.8% si)dan jumlah CPU yang menjalankan Virtual lain (0%) 4. Memory and Swap Pada baris 4 dan 5 ini akan ditampilkan informasi mengenai penggunaan memory dan swap. misalnya jumlah memory yang digunakan, memory bebas, cache dll 5. Process List Untuk lebih jauh mengenai baris diatas simak penjelasannya : PID = merupakan ID Proses.USER = user disini maksudnya pengguna yang merupakan pemilik prosesPR = merupakan prioritas prosesNI = merupakan Proses yang bagus untuk berjalanVIRT = Memory virtual yang digunakan oleh prosesRES = Memory fisik yang digunakan oleh prosesSHR = Proses yang disharing.S = Menunjukan status proses: S=sleep R=running Z=zombie%CPU = Persentase proses yang menggunakan CPU%MEM = Persentase proses yang menggunakan RAMTIME+ = Total waktu untuk seluruh aktivitas prosesCOMMAND = Nama proses Untuk yang saya coret bewarna merah pada gambar diatas, itu adalah user proses dari website-website yang ada pada server yang saya monitor. OK, sekian tutorial, tips dari saya untuk memonitor proses di linux. Sebenarnya ada lagi tutorial terkait perintah TOP ini, yaitu kombinasi-kombinasi tombol untuk memudahkan kita dalam menggunakan TOP untuk memonitor proses secara real time. Untuk tutorial kombinasi-kombinasi tombol dalam TOP akan saya buatkan video tutorial nya yang akan saya upload di channel saya, dan akan saya update di tutorial ini. Ditunggu ya…","link":"/2020/02/06/Monitoring-Proses-Di-Linux-Dengan-TOP-Command/"},{"title":"Mengatasi Masalah Akses Database Mysql Di Laravel","text":"Mulanya saya export database Mysql dari MAMP dan saya import ke XAMPP.Dan ketika project saya jalankan, muncul lah pesan error koneksi ke database gagal (Access denied for user ‘root’@’localhost’). Padahal semua settingan database pada Project laravel saya sudah saya pastikan 100% benar dan tidak ada yang terlupakan. Akhirnya browsing2 di google dan stackoverflow, saya menemukan solusinya.Cukup ketikkan salah satu command di bawah ini melalui terminal atau command prompt tepat pada directory project laravel kamu. 123php artisan config:cachephp artisan config:clearphp artisan cache:clear","link":"/2020/01/13/Mengatasi-Masalah-Akses-Database-Mysql-Di-Laravel/"},{"title":"Cara Mengetahui Lokasi ATM BCA Terdekat dengan VIRA","text":"Saat kita tiba di suatu daerah, adakalanya kita ingin untuk menarik uang tunai melalui ATM terdekat. Ya, biasanya kita akan mencari ATM terdekat yang sesuai dengan bank kartu ATM kita. Dalam artikel ini adalah bank BCA. Untuk mencari lokasi ATM BCA Terdekat kini BCA memudahkan nasabahnya dengan merilis Virtual Assistant yang bernama Vira. Dengan vira, kita bisa mencari ATM BCA terdekat dengan begitu mudah berdasarkan lokasi kita saat ini berada. Vira sendiri tersedia di 3 Aplikasi, yaitu Facebook Messenger, Line, dan Google Assistant. Berikut cara menggunakan Vira untuk mencari lokasi ATM BCA terdekat. Vira di Facebook Messenger Buka facebook, dan cari fanspage Bank BCA yang memiliki logo centang biru yang menandakan fanspage resmi bank BCA. Atau bisa juga buka link berikut http://facebook.com/BankBCA Lalu klik tombol Messenger, pastikan sebelumnya kamu sudah menginstal aplikasi Messenger di Android kamu. Ketik ATM Terdekat Dalam contoh ini saya pilih ATM Setor Tarik Ikuti petunjuk yang disampaikan Vira pada chat messenger dengan mengirimkan lokasi kamu sekarang. Pastikan GPS dalam keadaan hidup. Setelah kamu mengirimkan lokasi kamu, maka vira akan mencarikan lokasi ATM BCA terdekat. Vira di Google Assistant Buka aplikasi Google Assistant di gadget android kamu, lalu ketik atau katakan perintah “Bicara dengan bank BCA” Lalu pilih atau katakan “Lokasi ATM”, dan kemudian pilih jenis ATM yang kamu cari. Dalam contoh ini saya pilih ATM Tunai. Setelahnya pilih, pilihan Ya saat vira meminta lokasi kamu saat ini Vira akan menampilkan lokasi ATM BCA terdekat Vira di LINEUntuk menggunakan Vira di aplikasi LINE sama seperti menggunakan vira di Facebook Messenger. Berhubung saya tidak mempunyai Line, kalian bisa coba sendiri dengan panduan gambar dibawah ini. Demikian artikel tips Cara Mencari lokasi ATM BCA Terdekat ini. untuk informasi lebih lengkap terkait VIRA bisa anda baca pada link berikut http://www.bca.co.id/vira. Terimakasih.","link":"/2020/06/17/Cara-Mengetahui-Lokasi-ATM-BCA-Terdekat-dengan-VIRA/"},{"title":"Cara Dapat Uang 68 Juta Dari Internet Ala Deddy Corbuzier","text":"Bismillah… di era digital sekarang ini, peluang untuk Mencari Uang Lewat Internet semakin besar karena hampir segala lini bisnis mengandalkan internet baik untuk pemasaran, penjualan, branding, iklan, mencari pembeli, dan lainnya. Pada artikel ini, sesuai judulnya kita akan membahas bagaimana sih Cara Deddy Corbuzier Dapat Uang dari Internet. Selain dari channel youtube beliau yang menyajikan podcast ternyata diam-diam Deddy Corbuzier Dapat Uang 68 Juta Dari Internet dengan cara yang tidak kita sangka, tidak kita kepikiran sebelumnya, tapi pada umumnya kita pernah dengar bisnis ini. Bisnis apa itu ??? Oke sebelum kita lanjut membahas bisnis sampingan apa yang dilakukan om Ded, dan biar gak dibilang Hoax juga, coba kalian liat sendiri dari sumbernya kalau memang bener om Ded ini menghasilkan 68 juta. Klik link berikut untuk lihat pendapatan langsung Deddy Corbuzier Disini Oh ya sekilas info, apa yang om ded lakuin ini, saya juga pernah lakuin dahulu jadi bukan tipu-tipu loh ya. Tinggal gimana kita yang bekerja cerdas untuk menjalankannya. Ok, balik ke topik, kalau sudah klik link diatas lalu Scroll kebawah hingga di bagian tabel “Pengumuman Pencairan Komisi”, lalu pilih tombol “Lihat Selengkapnya” lalu scroll tabelnya pelan-pelan hingga kalian akan dapati nama beliau seperti screenshot dibawah ini yang saya ambil dari link diatas. Mungkin kalian akan bertanya-tanya, ada juga selain nama Deddy Corbuzier yang dapat uang jutaan bahkan ratusan juta lebih banyak dari beliau. Sudah tau bisnis apa yang dijalankannya ? Dijamin, bisnisnya gak perlu tenaga ekstra, keringat basah. hehehe… Jadi, ternyata Deddy Corbuzier ini menjalankan bisnis Program Afiliasi untuk memperoleh penghasilan 68 Juta. Apa itu program afiliasi ? Dikutip dari laman niagahoster, Program afiliasi adalah program yang memungkinkan Anda untuk mendapatkan komisi apabila Anda berhasil membuat orang lain menggunakan suatu produk. Jumlah dari komisi yang Anda dapatkan berbeda-beda tergantung kebijakan perusahaan yang Anda ikuti. Misalnya, Amazon yang menawarkan komisi hingga 10% bagi orang yang berhasil merekomendasikan produknya ke orang lain dan orang yang direkomendasikan membeli produk Amazon. Nah dari definisi diatas sudah paham belum ? kalau belum saya gambarkan contoh si om Deddy Corbuzier. Jadi om ded ini merekomendasikan produk dari Niagahoster yang berupa jualan Domain dan Hosting (apa lagi ini, hehehe. Domain itu nama website yang ada .com .id .org .co.id itu loh. dan Hosting itu adalah rumahnya atau tempat data-datanya sebuah website). Di Niagahoster dengan mengikuti program afiliasi kita akan dapat komisi 70% jika ada orang yang membeli domain dan hosting melalui link afiliasi yang kita dapatkan dari Niagahoster dan kita bagikan di Internet. Dan orang yang membeli produk Niagahoster dari link afiliasi tadi dapat potongan 70% jugaloh! semuanya diuntungkan bukan ? Contoh link afiliasi https://panel.niagahoster.co.id/ref/335442 Sangat mudah dan sederhana sekali kan ? kita cukup daftar di website niagahoster lalu kita akan diberikan link afiliasi, nah link afiliasi ini kita sebar diinternet jika ada yang klik link afiliasi kita, dan dia beli produk dari link kita, kita akan dapat komisi, begitulah kira-kira. Lantas si om ded ini kok bisa dapat banyak banget komisi hingga 68 juta begitu ? tentu saja beliau sebagai influencer yang terkenal dengan podcastnya di Youtube memanfaatkan hal ini dengan baik. Perhatikan gambar dibawah ini. Disalah satu video podcast beliau di Youtube, beliau meletakkan link afiliasi beliau disitu. Lihat saja yang liat video beliau berapa juta orang ? hahaha, kalau kita hitung-hitung sebenarnya yang klik link afiliasi beliau dan membeli produk Niagahoster itu tidak terlalu banyak. Kurang lebih dengan komisi per sales beliau dapat komisi Rp. 1,09 Juta. jadi 68 jt / 1,09 JT = kurang lebih 63 orang saja ternyata yang beli produk Niagahoster dari link afiliasi beliau. Tidak sulitkan menjalankan bisnis afiliasi ini ? lihat saja di daftar nama-nama penerima komisi dari Niagahoster diatas, ada nama-nama orang lain yang bukan publik figur juga yang malah menghasilkan lebih banyak dari Deddy Corbuzier. Itu artinya bisnis ini bisa dijalankan oleh siapapun. Hanya modal gadget dan kuota saja. Tapi tentunya anda harus pandai mempromosikan link afiliasi anda di Internet. Oh ya, untuk membantu anda dalam mempromosikan link afiliasi kamu, ada cara yang namanya Copywriting untuk menarik orang lain meng-klik link kamu. Apa itu Copywriting tentunya akan sangant panjang kalau dibahas disini. Saya ada menemukan kursus online GRATIS untuk Copywriting dari Udemy di link berikut Kursus Copywriting Gratis. Ok, berikut screenshot saya yang pernah mendapatkan komisi dari afiliasi serupa seperti yang dilakuin om ded, ya memang gak banyak sih, tapi saya sudah membuktikannya. Ya, saya berhasil mendapatkan komisi 300 ribu rupiah dari salah satu hosting provider pada tahun 2015 semasa saya kuliah dulu, lumayanlah untuk kuota internet dan isi bensin kala itu. hehehe… Oh ya, untuk kalian yang mau beli domain dan hosting dan dapat potongan harga 70% klik link dibawah ini! Hosting Murah! Mau diskon lagi ??Masukkan kode kupon berikut saat kalian checkout inside Kalian akan dapat potongan 5% lagi, jadi total potongan harga yang kalian akan dapat adalah 75 %. Semoga artikel ini bermanfaat, dan menambah wawasan kita dalam Mencari Uang dari Internet.","link":"/2020/07/02/Cara-Dapat-Uang-68-Juta-Dari-Internet-Ala-Deddy-Corbuzier/"}],"tags":[{"name":"php","slug":"php","link":"/tags/php/"},{"name":"web","slug":"web","link":"/tags/web/"},{"name":"error","slug":"error","link":"/tags/error/"},{"name":"laravel","slug":"laravel","link":"/tags/laravel/"},{"name":"pdf","slug":"pdf","link":"/tags/pdf/"},{"name":"report","slug":"report","link":"/tags/report/"},{"name":"linux","slug":"linux","link":"/tags/linux/"},{"name":"monitoring","slug":"monitoring","link":"/tags/monitoring/"},{"name":"mysql","slug":"mysql","link":"/tags/mysql/"},{"name":"tipstrik","slug":"tipstrik","link":"/tags/tipstrik/"},{"name":"umum","slug":"umum","link":"/tags/umum/"},{"name":"marketing","slug":"marketing","link":"/tags/marketing/"},{"name":"bisnis","slug":"bisnis","link":"/tags/bisnis/"}],"categories":[{"name":"PHP","slug":"PHP","link":"/categories/PHP/"},{"name":"Laravel","slug":"Laravel","link":"/categories/Laravel/"},{"name":"Linux","slug":"Linux","link":"/categories/Linux/"},{"name":"umum","slug":"umum","link":"/categories/umum/"},{"name":"marketing","slug":"marketing","link":"/categories/marketing/"}]}