{"pages":[],"posts":[{"title":"Monitoring Proses Di Linux Dengan TOP Command","text":"TOP! Kali ini saya akan berbagi pengalaman dan sedikit ilmu dalam dunia Linux. Saya sendiri bukan orang yang expert di bidang linux, tapi saya akan share bagaimana cara memonitor linux secara real time dalam hal kinerja sistem seperti CPU, Memory, Serta Proses yang sedang berjalan. Perintah yang kita gunakan untuk memonitor linux ini adalah dengan perintah TOP. Oh ya, perintah TOP ini sangat bermanfaat dan sering digunakan jika di dalam server linux kamu terdapat beberapa website. Ketika salah satu website di server tersebut DOWN, kita bisa memantau website mana yang DOWN, apakah karena murni Traffic pengunjung atau di DDOS, atau ada IP yang SPAMMING ke website kita. OK, langsung kita praktekkan perintah TOP ini. Ketik diterminal… 1top Maka akan keluar hasil Penjelasan dari keluaran perintah TOP di atas. 1. ROW - TOP (baris pertama) Disini kita bisa melihat informasi berupa :Waktu saat ini : (09:56:29)Mesin Berjalan : (up 36 hari)Sesi user login : 1 userRata-rata beban systen (load average: 2.29, 2.60, 3.45) 2. Task Disini kita bisa melihat informasi berupa :Total proces yang sedang berjalan (264 total)Proses yang sedang berjalan (1 running)Proses yang sleeping (261 sleeping)Proses yang sedang berhenti (0 stoped)Proses zombie (2 zombie) 3. CPU Disini kita bisa melihat informasi berupa :Persentase pemakaian CPU untuk proses pengguna (18.1% us)Persentase proses CPU yang digunakan sistem (5.3%sy)Persentase proses CPU yang mendapatkan prioritas Update (0.0% ni)Presentase CPU yang tidak terpakai (73.9% id)Persentase CPU yang menunggu proses I/O (1.9% wa)Penggunaan CPU untuk service hardware (0.0% hi)Penggunaan CPU untuk service software (0.8% si)dan jumlah CPU yang menjalankan Virtual lain (0%) 4. Memory and Swap Pada baris 4 dan 5 ini akan ditampilkan informasi mengenai penggunaan memory dan swap. misalnya jumlah memory yang digunakan, memory bebas, cache dll 5. Process List Untuk lebih jauh mengenai baris diatas simak penjelasannya : PID = merupakan ID Proses.USER = user disini maksudnya pengguna yang merupakan pemilik prosesPR = merupakan prioritas prosesNI = merupakan Proses yang bagus untuk berjalanVIRT = Memory virtual yang digunakan oleh prosesRES = Memory fisik yang digunakan oleh prosesSHR = Proses yang disharing.S = Menunjukan status proses: S=sleep R=running Z=zombie%CPU = Persentase proses yang menggunakan CPU%MEM = Persentase proses yang menggunakan RAMTIME+ = Total waktu untuk seluruh aktivitas prosesCOMMAND = Nama proses Untuk yang saya coret bewarna merah pada gambar diatas, itu adalah user proses dari website-website yang ada pada server yang saya monitor. OK, sekian tutorial, tips dari saya untuk memonitor proses di linux. Sebenarnya ada lagi tutorial terkait perintah TOP ini, yaitu kombinasi-kombinasi tombol untuk memudahkan kita dalam menggunakan TOP untuk memonitor proses secara real time. Untuk tutorial kombinasi-kombinasi tombol dalam TOP akan saya buatkan video tutorial nya yang akan saya upload di channel saya, dan akan saya update di tutorial ini. Ditunggu ya…","link":"/2020/02/06/Monitoring-Proses-Di-Linux-Dengan-TOP-Command/"},{"title":"Mengatasi Masalah Akses Database Mysql Di Laravel","text":"Mulanya saya export database Mysql dari MAMP dan saya import ke XAMPP.Dan ketika project saya jalankan, muncul lah pesan error koneksi ke database gagal (Access denied for user ‘root’@’localhost’). Padahal semua settingan database pada Project laravel saya sudah saya pastikan 100% benar dan tidak ada yang terlupakan. Akhirnya browsing2 di google dan stackoverflow, saya menemukan solusinya.Cukup ketikkan salah satu command di bawah ini melalui terminal atau command prompt tepat pada directory project laravel kamu. 123php artisan config:cachephp artisan config:clearphp artisan cache:clear","link":"/2020/01/13/Mengatasi-Masalah-Akses-Database-Mysql-Di-Laravel/"},{"title":"Membuat Report PDF Laravel Dengan Package Laravel Snappy","text":"Sangat banyak sekali package Laravel untuk membuat laporan dalam bentuk PDF. Nah kali ini kita akan meggunakan package Laravel Snappy. Kenapa Laravel Snappy ? Dari yang saya coba di beberapa aplikasi yang saya buat dengan package Laravel Snappy. Package ini dapat menampilkan Grafik pada PDF dengan cepat, dan juga menampilkan halaman pdf yang berisi teks biasa, tabel, gambar dan konten lainnya secara cepat. Kenapa bisa cepat ? di Laravel Snappy prinsip kerjanya adalah mengubah tampilan (view) yang kita desain dalam kode HTML biasa menjadi file PDF dengan sangat cepat ketimbang package lainnya untuk membuat PDF di laravel. Oh ya, sebelum lanjut ke tutorialnya saya disini menginstall web laravel saya di server ubuntu 18.04. Nah, jika kamu yang menginstal web laravelnya di hosting atau shared hosting tenang saja, nanti akan saya jelaskan sedikit perbedaanya saat pemasangan package ini. Oke kita mulai.. Proses Instalasi Install dependecies yang diperlukan Note. Jika kamu menginstall di server 32 bit install depedencies berikut.Ketik di terminal 12$ composer require h4cc/wkhtmltopdf-i386 0.12.x$ composer require h4cc/wkhtmltoimage-i386 0.12.x Note. Jika kamu menginstall di server 64 bit install depedencies berikut.Ketik di terminal 12$ composer require h4cc/wkhtmltopdf-amd64 0.12.x$ composer require h4cc/wkhtmltoimage-amd64 0.12.x Install package yang diperlukan Install package berikut, ketik di terminal 1composer require barryvdh/laravel-snappy Konfigurasi package yang telah di install Buka projek laravel kamu, masuk ke folder config. Lalu buka file app.php. Pada bagian providers tambahkan class package seperti diatas. dan pada bagian aliases tambahkan class PDF dan class SnappyImage. Publish vendor folder Jalankan perintah berikut di terminal 1php artisan vendor:publish --provider=\"Barryvdh\\Snappy\\ServiceProvider\" Oke, setelah maluli tahap proses instalasi, kita akan masuk ke tahapan konfigurasi yang cukup melelahkan, hehehhe. Tahap KonfigurasiKetik di terminal 1cp vendor/h4cc/wkhtmltoimage-amd64/bin/wkhtmltoimage-amd64 /usr/local/bin/ Lalu ketik lagi 1cp vendor/h4cc/wkhtmltopdf-amd64/bin/wkhtmltopdf-amd64 /usr/local/bin/ Note : Jika kamu menginstall web laravel nya di server langsung ikuti cara ini, jika di shared hosting abaikan tahapan ini. Setelah menjalankan perintah copy diatas, selanjutnya set kedua folder di lokasi tujuan copy diatas menjadi permission 777. Ketik lagi 12chmod -R 777 /usr/local/bin/wkhtmltoimage-amd64chmod -R 777 /usr/local/bin/wkhtmltopdf-amd64 Sekarang lakukan konfigurasi pada file projek laravel kamu config/snappy.php. Untuk yang menginstall di server langsung Sesuaikan isi nya dengan isi berikut. 12345678910111213141516return array( 'pdf' =&gt; array( 'enabled' =&gt; true, 'binary' =&gt; '/usr/local/bin/wkhtmltopdf-amd64', 'timeout' =&gt; false, 'options' =&gt; array(), 'env' =&gt; array(), ), 'image' =&gt; array( 'enabled' =&gt; true, 'binary' =&gt; '/usr/local/bin/wkhtmltoimage-amd64', 'timeout' =&gt; false, 'options' =&gt; array(), 'env' =&gt; array(), ),); Untuk yang menginstall di shared hosting Sesuaikan isi nya dengan isi berikut. 12345678910111213141516return array( 'pdf' =&gt; array( 'enabled' =&gt; true, 'binary' =&gt; base_path('vendor/h4cc/wkhtmltopdf-amd64/bin/wkhtmltopdf-amd64'), 'timeout' =&gt; false, 'options' =&gt; array(), 'env' =&gt; array(), ), 'image' =&gt; array( 'enabled' =&gt; true, 'binary' =&gt; base_path('vendor/h4cc/wkhtmltoimage-amd64/bin/wkhtmltoimage-amd64'), 'timeout' =&gt; false, 'options' =&gt; array(), 'env' =&gt; array(), ),); SELESAI…. Kamu bisa mencoba untuk mengenerate file PDF di laravel Untuk penggunaan Laravel Snappy sendiri kamu bisa langsung cek dokumentasinya di https://github.com/barryvdh/laravel-snappy TroubleshootJika setelah melakukan tahapan instalasi dan kofigutasi kamu dapati error 12The exit status code '1' says something went wrong:stderr: \"blablablabalbalba\" Berikut solusi nya untuk ubuntu 18.04 1sudo apt install libssl1.0-dev untuk ubuntu 14.04 1sudo apt install libssl-dev=1.0.1f-1ubuntu2.25","link":"/2020/03/02/Membuat-Report-PDF-Laravel-Dengan-Package-Laravel-Snappy/"},{"title":"Menampilkan Error di Halaman Blank PHP","text":"Adakalanya ketika kita mengakses website atau halaman web yang kita bangun, kita hanya ditampilkan halaman BLANK putih saja, yang membuat kita bingung apa yang terjadi di web tersebut.Untuk menampilkan error di website yang menggunakan PHP, copy dan paste kode berikut di file php yang ingin kamu debug. Pastikan kamu meletakkan kode berikut di baris paling awal. 123ini_set('display_errors', 1);ini_set('display_startup_errors', 1);error_reporting(E_ALL); Kode diatas cara tercepat untuk menampilkan php error dan warning dari halaman web kita yang hanya tampil tampilan BLANK saja.Sekian tips singkat dan sederhana dari saya, semoga bermanfaat.","link":"/2020/01/29/Menampilkan-Error-di-Halaman-Blank-PHP/"}],"tags":[{"name":"linux","slug":"linux","link":"/tags/linux/"},{"name":"monitoring","slug":"monitoring","link":"/tags/monitoring/"},{"name":"laravel","slug":"laravel","link":"/tags/laravel/"},{"name":"mysql","slug":"mysql","link":"/tags/mysql/"},{"name":"pdf","slug":"pdf","link":"/tags/pdf/"},{"name":"report","slug":"report","link":"/tags/report/"},{"name":"php","slug":"php","link":"/tags/php/"},{"name":"web","slug":"web","link":"/tags/web/"},{"name":"error","slug":"error","link":"/tags/error/"}],"categories":[{"name":"Linux","slug":"Linux","link":"/categories/Linux/"},{"name":"Laravel","slug":"Laravel","link":"/categories/Laravel/"},{"name":"PHP","slug":"PHP","link":"/categories/PHP/"}]}